app/views/pages/home.html.erb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
---
                  <div class="col-sm-6" style="font-size: 80%; opacity: 0.7;">POSTS<br>
                  <h6 style="color: #0084B4; font-size: 200%;"><%= current_user.posts.count %></h6>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
                  <div class="sol-sm-11">
                      <p class="post-title"><%= User.find(@p.user_id).username %> - <%= @p.created_at.to_formatted_s(:short) %></p>